Revit 2027 API
BuiltInFailures.RebarCouplerFailures.CouplerTypeInvalid Property
 This coupler type does not fit on the selected bar(s). Post error to delete the coupler.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouplerTypeInvalid { get; }
Public Shared ReadOnly Property CouplerTypeInvalid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouplerTypeInvalid {
	FailureDefinitionId^ get ();
}
static member CouplerTypeInvalid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace